import React from 'react';

const Blogs = () => {
    return (
        <div className='container mt-3'>

            <h4>১। Context API কীভাবে কাজ করে?</h4>
            <p>React context API হল রিয়েক্ট এ্যাপ এর জন্য কার্যকরভাবে গ্লোবাল ভেরিয়েবল তৈরি করার একটি উপায়, এটি চারপাশে পাস করা যায়। একটি সাধারণ প্রতিক্রিয়া অ্যাপ্লিকেশনে, প্রপসের মাধ্যমে ডেটা টপ-ডাউন (বাবা-মায়ের কাছে) পাস করা হয়। এটি একটি ভোক্তা এবং একটি প্রদানকারী প্রদান করে। প্রদানকারী এমন একটি উপাদান যা এটির নাম অনুসারে তার সন্তানদের রাষ্ট্র প্রদান করে। </p>
            <h4>২। সিমান্টিক ট্যাগ কি?</h4>
            <p>সিমান্টিক ট্যাগ এর মূল বৈশিষ্ট হল ব্রাউজার উভয়ের কাছে স্পষ্টভাবে এর অর্থ যোগাযোগ করে। এই উপাদানগুলি স্পষ্টভাবে এর বিষয়বস্তু সংজ্ঞায়িত করে। সিমান্টিক ট্যাগ ব্যাবহার এ HTML পেইজ গুলো পড়া অনেক সহজ। এটি একটি ভাল ব্যবহারকারীর অভিজ্ঞতা প্রদান করে। এটা বৃহত্তর অ্যাক্সেসিবিলিটি আছে। </p>
        </div>

    );
};

export default Blogs;
